
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АптечныйПункт_Потрибитель Приход
	Движения.АптечныйПункт_Потрибитель.Записывать = Истина;
	Для Каждого ТекСтрокаКорзина Из Корзина Цикл
		Движение = Движения.АптечныйПункт_Потрибитель.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.АптечныйПункт = АптечныйПункт;
		Движение.Товар = ТекСтрокаКорзина.Товар;
		Движение.Количество = ТекСтрокаКорзина.Количество;
	КонецЦикла;

	// регистр ОборотыПродаж 
	Движения.ОборотыПродаж.Записывать = Истина;
	Для Каждого ТекСтрокаКорзина Из Корзина Цикл
		Движение = Движения.ОборотыПродаж.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаКорзина.Товар;
		Движение.АптечныйПункт = АптечныйПункт;
		Движение.Продавец = Продавец;
		Движение.Покупатель = Заказчик;
		Движение.Выручка = ТекСтрокаКорзина.Сумма;
		Движение.Количество = ТекСтрокаКорзина.Количество;
	КонецЦикла;

	// регистр РегистрПрибыли Приход
	Движения.РегистрПрибыли.Записывать = Истина;
	Для Каждого ТекСтрокаКорзина Из Корзина Цикл
		Движение = Движения.РегистрПрибыли.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаКорзина.Товар;
		Движение.Сумма = ТекСтрокаКорзина.Сумма;
		Движение.Количество = ТекСтрокаКорзина.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
