
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПересчитатьСумму();	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСумму()
	Сумма=0;
	Корзина=Объект.Корзина;
	Для каждого Строка Из Корзина Цикл
	     Сумма=Сумма+Строка.Сумма
	 КонецЦикла;
	 Объект.СуммаЗаказа=Сумма;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Сообщить("2у");
КонецПроцедуры

&НаКлиенте
Процедура КорзинаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажаЗаказ(СтрокаТабличнойЧасти);
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КорзинаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажаЗаказ(СтрокаТабличнойЧасти);
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КорзинаТоварПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена=СерверныеФункции.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Товар);
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажаЗаказ(СтрокаТабличнойЧасти);
	ПересчитатьСумму();
КонецПроцедуры
