
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Дата=ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура БППоставокВАптечныйПункт(Команда)
	ОткрытьФорму("БизнесПроцесс.ПоставкаТовараВАптечныйПункт.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура БППоставокНаСклад(Команда)
	ОткрытьФорму("БизнесПроцесс.ПоставкаТовараНаСклад.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыЦен(Команда)
	ОткрытьФорму("ОбщаяФорма.ИзменениеКоэффициентовЦен");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТоваровНаСкладе(Команда)
	ОткрытьФорму("Отчет.ОстаткиТоваровНаСкладах.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачиАптечнымПунктам(Команда)
	ОткрытьФорму("Задача.ЗадачиАптечнымПунктам.Форма.ФормаЗадач");
КонецПроцедуры

&НаКлиенте
Процедура ПрибыльАптечныхПунктов(Команда)
	ОткрытьФорму("Отчет.ПрибыльАптечныхПунктов.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура ПрибыльОтРеализацииТоваров(Команда)
	ОткрытьФорму("Отчет.ПрибыльОтРеализацииТоваров.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрИнформацииОбОрганизации(Команда)
	 ОткрытьФорму("ОбщаяФорма.ИнформацияОбОрганизации");
КонецПроцедуры
