
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СписокПродаж.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокПродаж.АптечныйПункт,
	|	СписокПродаж.Дата,
	|	СписокПродаж.Номер,
	|	СписокПродаж.Покупатель,
	|	СписокПродаж.Продавец,
	|	СписокПродаж.Корзина.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.СписокПродаж КАК СписокПродаж
	|ГДЕ
	|	СписокПродаж.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКорзинаШапка = Макет.ПолучитьОбласть("КорзинаШапка");
	ОбластьКорзина = Макет.ПолучитьОбласть("Корзина");
	ОбластьИтог=Макет.ПолучитьОбласть("Всего");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьКорзинаШапка);
		ВыборкаКорзина = Выборка.Корзина.Выбрать();
		СуммаИтог=0;
		Пока ВыборкаКорзина.Следующий() Цикл
			ОбластьКорзина.Параметры.Заполнить(ВыборкаКорзина);
			ТабДок.Вывести(ОбластьКорзина, ВыборкаКорзина.Уровень());
			СуммаИтог=СуммаИтог+ВыборкаКорзина.Сумма;
		КонецЦикла;
		
		ОбластьИтог.Параметры.ВсегоПоДокументу=СуммаИтог;
		ТабДок.Вывести(ОбластьИтог);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

