&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Дата=ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиАптечнымПунктам(Команда)
	ОткрытьФорму("Задача.ЗадачиАптечнымПунктам.Форма.ФормаЗадач");
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПоставкиВАптечныйПункт(Команда)
	ОткрытьФорму("Задача.ЗадачиПоставкиВАптечныеПункты.Форма.МоиЗадачи");
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПоставкиНаСклад(Команда)
	ОткрытьФорму("Задача.ЗадачиПоставкиНаСклад.Форма.МоиЗадачи");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТоваровНаСкладе(Команда)
	ОткрытьФорму("Отчет.ОстаткиТоваровНаСкладах.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура ПрибыльныйТовар(Команда)
	ОткрытьФорму("Отчет.ПрибыльОтРеализацииТоваров.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура РейтингТоваров(Команда)
	ОткрытьФорму("Отчет.РейтинТоваров.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура Сотрудники(Команда)
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Товары(Команда)
	ОткрытьФорму("Справочник.Товары.Форма.ФормаГруппы");
КонецПроцедуры

&НаКлиенте
Процедура Цены(Команда)
	ОткрытьФорму("РегистрСведений.Цены.Форма.ФормаСписка");
КонецПроцедуры
