&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадачи(МассивЗадач, НовыйСтатус)
	Для Каждого ТекЗадача Из МассивЗадач Цикл // Обойдем все элементы массива
		ЗадачаОбъекта=ТекЗадача.ПолучитьОбъект(); // Получаем объект по ссылке
		
		Если ЗадачаОбъекта.Статус=НовыйСтатус Тогда
		     Продолжить;
		 КонецЕсли;
		 
		 ЗадачаОбъекта.Статус=НовыйСтатус;
		 
		 Если НовыйСтатус = Перечисления.СтатусыЗадач.Готово Тогда
			  ЗадачаОбъекта.Выполнено=Истина
		 КонецЕсли;
		 
		 // Используем обработчик ошибок, чтобы оперативноя выявить проблему при записи
		 Попытка
			 ЗадачаОбъекта.Записать();
		     // Программная запись/проведение/отмена проведения документа осуществляется при помощи метода Записать
		 Исключение
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст="Не удалось изменить статус задачи "+ТекЗадача+" по причине: "+ОписаниеОшибки();
			 // Описание ошибки -  петод для получения ошибки
			 Сообщение.Сообщить();
		 КонецПопытки;
		 
	 КонецЦикла;
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыЗадачКлиент(МассивЗначений,НовыйСтатус)
	
	Если ТипЗнч(МассивЗначений)=Тип("Массив")Тогда
		ОбновитьСтатусЗадачи(МассивЗначений, НовыйСтатус);
	КонецЕсли;

	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиАптечнымПунктам"));
КонецПроцедуры


&НаКлиенте
Процедура СписокНужноВыполнитьПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.НужноВыполнить"));
КонецПроцедуры

&НаКлиенте
Процедура ВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.ВРаботе"));
КонецПроцедуры

&НаКлиенте
Процедура ГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Готово"));
КонецПроцедуры


// Излишнее повторение. Лучше организовать через процедуру!

//&НаКлиенте
//Процедура ГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
//	   МассивЗначений=ПараметрыПеретаскивания.Значение;
//	Если ТипЗнч(МассивЗначений)=Тип("Массив")Тогда
//		ОбновитьСтатусЗадачи(МассивЗначений, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Готово"));
//	КонецЕсли;
//	
//КонецПроцедуры
