Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ТоварДоставлен=Ложь;
	
КонецПроцедуры


Процедура ЗаполнитьДокументПоставкиНаСкладПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура РазгрузитьТоварПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ТоварДоставлен=Истина;
КонецПроцедуры

Процедура ОпределитьСкладПоставкиПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не выполнены действия, необходимые для выполнения задачи!", СтатусСообщения.Важное);
   	 	Отказ = Истина;
	Иначе
		// Обнавляем данные документа
		ДокументПоставкиНаСклад=СсылкаДокументаПоставки.ПолучитьОбъект();
		ДокументПоставкиНаСклад.Склад=Склад;
		ДокументПоставкиНаСклад.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;

КонецПроцедуры

Процедура ПровестиДокументПоставкиНаСкладОбработка(ТочкаМаршрутаБизнесПроцесса)
	ДокументПоставкиНаСклад=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументПоставкиНаСклад.ДатаПоставки=ТекущаяДата();
	ДокументПоставкиНаСклад.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
