Процедура ПередатьИнформациюПоставщикуПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Если в ручную заполняют документ поставки и по какой-то причине забывают указать склад
	 Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не указан склад, куда необходимо осуществлять поставку!", СтатусСообщения.Важное);
   	 	Отказ = Истина;
	Иначе
		// Обнавляем данные документа
		ДокументПоставкиНаСклад=СсылкаДокументаПоставки.ПолучитьОбъект();
		ДокументПоставкиНаСклад.Склад=Склад;
		ДокументПоставкиНаСклад.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;  
	
	// Создасться печатная форма, которую бухгалтер сохранит и передаст поставщику
	
	 СостояниеПоставки=Перечисления.СостояниеПоставки.ВОбработке;
	 
КонецПроцедуры

Процедура ОдобритьПоставкуПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	 СостояниеПоставки = Перечисления.СостояниеПоставки.ТоварДоставляется;
	 // Отправление сообщения поставщику !!!
КонецПроцедуры


Процедура ЗаполнитьЦеныНаТоварПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	 // Проверка на заполнение цен от поставщика
	 
	СостояниеПоставки=Перечисления.СостояниеПоставки.ТоварДоставляется; 
КонецПроцедуры

Процедура РазгрузитьТоварПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	СостояниеПоставки=Перечисления.СостояниеПоставки.Выполнена;
КонецПроцедуры

Процедура ОпределитьСкладПоставкиПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
КонецПроцедуры

Процедура ПровестиДокументПоставкиНаСкладОбработка(ТочкаМаршрутаБизнесПроцесса)
	ДокументПоставкиНаСклад=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументПоставкиНаСклад.ДатаПоставки=ТекущаяДата();
	ДокументПоставкиНаСклад.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры






