Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ИмяПольз = ИмяПользователя();
  	ТекПользователь = Справочники.Сотрудники.НайтиПоНаименованию(ИмяПольз, Истина);	
	
	// Для автоматического создания новых ползователей в справочнике:
	
	//Если Не ЗначениеЗаполнено(ТекПользователь) Тогда
	//    	НовыйПользователь = Справочники.Сотрудники.СоздатьЭлемент();
	//    	НовыйПользователь.Наименование = ИмяПольз;
	//    	НовыйПользователь.Код = ИмяПольз;
	//    	НовыйПользователь.Записать();
	//    	ТекПользователь = НовыйПользователь.Ссылка;
	//  КонецЕсли;    
	
	ПараметрыСеанса.ТекущийПользователь=ТекПользователь;
	Сообщить("С возвращением, "+ТекПользователь); 
	
	ПроверкаНаВыполнениеЗадач(ИмяПольз);
	
	КонецПроцедуры
		
		
Процедура ПроверкаНаВыполнениеЗадач(ИмяПольз)
		
	// Запрос = Новый Запрос;
	// Запрос.Текст =
	//"ВЫБРАТЬ
	//|	РегистрАдресации.Должность КАК Должность,
	//|	РегистрАдресации.Пользователь
	//|ИЗ
	//|	РегистрСведений.РегистрАдресации КАК РегистрАдресации
	//|ГДЕ
	//|	РегистрАдресации.Пользователь = &ИмяПольз";
	// 
	// Запрос.УстановитьПараметр("ИмяПольз",ИмяПольз);
	// РезультатЗапроса=Запрос.Выполнить();
	// 
	// Записи = РезультатЗапроса.Выбрать();
	// 
	 
	//НаборЗаписей = РегистрыСведений.РегистрАдресации.СоздатьНаборЗаписей();
	//НаборЗаписей.Прочитать();
	 
	 
	// Аптечные пункты
				
	//СтатусПоиска1=Перечисления.СтатусыЗадач.НужноВыполнить;
	//НеВыполненныеЗадачи1=Задачи.ЗадачиАптечнымПунктам.НайтиПоРеквизиту("Статус",СтатусПоиска1);
	//СтатусПоиска2=Перечисления.СтатусыЗадач.ВРаботе;
	//НеВыполненныеЗадачи2=Задачи.ЗадачиАптечнымПунктам.НайтиПоРеквизиту("Статус",СтатусПоиска2);

	//Если ЗначениеЗаполнено(НеВыполненныеЗадачи1) ИЛИ ЗначениеЗаполнено(НеВыполненныеЗадачи2) Тогда
	//	Сообщить("Имеются невыполненные задачи для аптечных пунктов");
	//КонецЕсли;
	
			// Поставка в Аптечный пункт
			
			
			
			// Поставка на склад
	
			
		
КонецПроцедуры
		
