Функция ПолучитьКонстантуИзменЦены(Отделение) Экспорт
	Если Отделение="Аптечный пункт №1" Тогда
		Возврат(Константы.КоэффициентИзмененияЦеныОтделения1.Получить());
	Иначе
		Возврат(Константы.КоэффициентИзмененияЦеныОтделения2.Получить());	
	КонецЕсли
КонецФункции

Функция РозничнаяЦена(АктуальнаяДата,Товар) Экспорт
	Отбор=Новый Структура("Товар",Товар);
	ЗначенияРесурсов=РегистрыСведений.Цены.
	ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат ЗначенияРесурсов.Цена;
КонецФункции                                                       