Функция ПолучитьКонстантуИзменЦены(Отделение) Экспорт
	Возврат(Константы.КоэффициентИзмененияЦеныОтделения.Получить()); 		
	//Если Отделение="Аптечный пункт №1" Тогда 
	//  Возврат(Константы.КоэффициентИзмененияЦеныОтделения1.Получить());
	//Иначе
	//	Возврат(Константы.КоэффициентИзмененияЦеныОтделения2.Получить());	
	//КонецЕсли        
	
КонецФункции

Функция РозничнаяЦена(АктуальнаяДата,Товар) Экспорт
	Отбор=Новый Структура("Товар",Товар);
	ЗначенияРесурсов=РегистрыСведений.Цены.
	ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат ЗначенияРесурсов.Цена;
КонецФункции                                                       

Функция Магия(Команда)Экспорт	
	//Первым делом нам необходимо создать новый профиль подключения к серверу.
	ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
 
	//Так как мы будем отправлять письма, нам будет необходим только SMTP адрес 
	//нашего почтового сервера. Для примера, возьмем Яндекс.
	ПрофильПодключения.АдресСервераSMTP ="smtp.yandex.ru";
 
	//Сервер Яндекса требует обязательного SSL шифрования.
	ПрофильПодключения.ИспользоватьSSLSMTP=Истина;
 
	//Так как мы подключаемся через SSL, указываем порт 465. Если подключение
	//не защищенное, то используем порт 25
	ПрофильПодключения.ПортSMTP = 465;
 
	//Прописываем пользователя от имени которого будет осуществляться подключение 
	//к почтовому серверу и его пароль	
	ПрофильПодключения.ПользовательSMTP = "kapiburka_ivan2000@mail.ru";
	ПрофильПодключения.ПарольSMTP ="EspeciallyPass777";
 
	//Создаем объект ИнтернетПочта
	Почта = Новый ИнтернетПочта;
 
	//Пытаемся подключится к серверу используя наши настройки.
	Попытка
		Почта.Подключиться(ПрофильПодключения);
	Исключение
		Сообщить("Не удалось подключиться к серверу smtp.yandex.ru");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
 
	//Определяемся с текстом письма
	Тело="Добрый день!
	|Вас приветствует компания ""Ромашка""
	|Будем рады видеть Вас в числе наших клиентов!     
	|";
 
	//Создаем сообщение
	Письмо = Новый ИнтернетПочтовоеСообщение;
 
	//Добавляем наш текст в письмо
	Письмо.Тексты.Добавить(Тело);
 
	//Добавляем тему
	Письмо.Тема = "У нас есть товар для Вас!";
 
	//Добавляем ту же почту, через которую подключаемся к серверу
	//Для таких серверов, как Яндекс, Мейл, Гугл эти почты должны обязательно совпадать
	//Однако, имея свой почтовый сервер для домена, можно использовать любую другую почту 
	//с вашим доменом для отправки (по крайней мере, у нас так работает).
	Письмо.Отправитель = "serge_petrov86@mail.ru";
 
	//Добавляем имя отправителя
	Письмо.ИмяОтправителя = "Отдел впаривания товаров";
 
	//Добавляем получателя
	Письмо.Получатели.Добавить("kapiburka_ivan2000@mail.ru");
 
	//Для массовых рассылок можно использовать СлепыеКопии, что бы получатели не видели, 
	//кому еще отправлялось это письмо.
	Письмо.СлепыеКопии.Добавить("kapiburka_ivan2000@mail.ru");
 
	//Теперь пытаемся отправить письмо
    Попытка
		Почта.Послать(Письмо);
    Исключение
        Сообщить("Не удалось отправить письмо ");
        Сообщить(ОписаниеОшибки());
	КонецПопытки;	
 
	//Обязательно отключаемся от почтового сервера по завершении отправки письма.	
	Почта.Отключиться();
 
КонецФункции
