
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Товары.ТекущиеДанные;
	ФункцииДляРаботыСДокументами.РассчитатьСуммуСклад(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Товары.ТекущиеДанные;
	ФункцииДляРаботыСДокументами.РассчитатьСуммуСклад(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.Склад.ТолькоПросмотр=Истина;
КонецПроцедуры



