
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПоставкаВПункты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставкаВПункты.АптечныйПункт,
	|	ПоставкаВПункты.Дата,
	|	ПоставкаВПункты.ДатаПоставки,
	|	ПоставкаВПункты.ДоставкаВыполнена,
	|	ПоставкаВПункты.Номер,
	|	ПоставкаВПункты.ОсуществляетДоставку,
	|	ПоставкаВПункты.СоСклада,
	|	ПоставкаВПункты.Товары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество
	|	)
	|ИЗ
	|	Документ.ПоставкаВПункты КАК ПоставкаВПункты
	|ГДЕ
	|	ПоставкаВПункты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьПодтверждение=Макет.ПолучитьОбласть("Подтверждение");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;
		ТабДок.Вывести(ОбластьПодтверждение);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
