
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Склад_АптечныйПункт Расход
	Движения.Склад_АптечныйПункт.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Склад_АптечныйПункт.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Склад = СоСклада;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр АптечныйПункт_Потрибитель Приход
	Движения.АптечныйПункт_Потрибитель.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.АптечныйПункт_Потрибитель.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.АптечныйПункт = АптечныйПункт;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	 
Если имеетсяБизнесПроцесс=Ложь Тогда 
	НовыйБизнесПроцесс = БизнесПроцессы.ПоставкаТовараВАптечныйПункт.СоздатьБизнесПроцесс();
	имеетсяБизнесПроцесс=Истина;
	
	// shift+F9 - отладка
	ТаблицаТоваров = Товары.Выгрузить();
	// Заполняем табл часть БП
	Для Каждого СтрТаблТов Из ТаблицаТоваров Цикл
		//Добавляет строку в конец табличной части
		СтрБП = НовыйБизнесПроцесс.Товары.Добавить();
    	СтрБП.Наименование = СтрТаблТов.Товар;
    	СтрБП.Количество = СтрТаблТов.Количество;  		
	КонецЦикла;
	
	НовыйБизнесПроцесс.АптечныйПункт=АптечныйПункт;
	НовыйБизнесПроцесс.Дата = ТекущаяДата();
	НовыйБизнесПроцесс.СостояниеПоставки=Перечисления.СостояниеПоставки.ПоставкаНеОсущствлена;
	НовыйБизнесПроцесс.СсылкаДокументаПоставки=Ссылка;
	НовыйБизнесПроцесс.Записать();
	НовыйБизнесПроцесс.Старт();
КонецЕсли;

КонецПроцедуры
